data = {
    "building_code": [10000, 10001, 10002, 10003, 10004, 10005],
    "building_name": ["P-44", "I-700", "P-3", "1-553", "P-44T", "P-44T25"],
    "district_code": [523493, 523494, 542340, 546325],
    "district_name": ["Ленинский", "Октябрьский", "Заводской", "Волжский", "Левобережный", "Правобережный"],
    "adress": ['Ленинская', 'Октябрьская', 'Кировская', 'Ульяновская', 'К. Маркса', 'Энгельская', 
               'Московская', 'Волжская', 'Парковый проезд', 'Мирный переулок'],
    "material": [(6001, "Железобетон"), (6002, "Кирпич"), (6003, "Панель"), (6004, 'Вата')],
    "critera_code": [27001, 27002, 27003, 27004, 27005, 27006],
    "critera_name": ["экология", "чистота", "соседи", "условия для детей", "магазины", "безопасность"],
    "agent_code": [50421, 50123, 55424, 50912, 52631, 53734],
    "area": [(35.5, 1), (40, 1), (45.5, 1), (60, 2), (67.5, 2), (80, 3), (83.5, 3), (85, 3), (95.5, 4), (105, 4), (120, 5)],
    "current_state": ["pending", "active", "suspended", "sold", "active", "active", "active"],
    "phone": ["+7-(937)-975-54-12", "+7-(937)-983-63-01", "+7-(936)-926-64-46", "+7-(936)-975-12-75", "+7-(927)-901-76-43", "+7-(927)-926-92-16"] 
}

base_id_object = 1000000
base_id_rating = 7000000
base_id_deal = 4000000